# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [137]:
import numpy as np
import pandas as pd
from scipy.stats import shapiro
from scipy.stats import ttest_ind
from scipy.stats import t
import scipy.stats as st
import scipy.stats as ztest
import warnings
warnings.filterwarnings('ignore')
from scipy import stats as stats

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

Examine the `salaries` dataset using the `head` function below.

In [6]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [9]:
nan_cols=salaries.isna().sum()

nan_cols[nan_cols>0]

Typical Hours    25161
Annual Salary     8022
Hourly Rate      25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [13]:
notnull_col = salaries.notna().sum()
notnull_col[notnull_col>0]

# Hay 8022 empleados por horas y 25161 asalariados

Name                 33183
Job Titles           33183
Department           33183
Full or Part-Time    33183
Salary or Hourly     33183
Typical Hours         8022
Annual Salary        25161
Hourly Rate           8022
dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [32]:
departamentos = []
valores = []
for e in salaries['Department'].value_counts():
    departamentos.append(e, order)
for u in salaries.Department.unique():
    valores.append(u)

In [31]:
salaries.Department.unique()

array(['POLICE', 'GENERAL SERVICES', 'WATER MGMNT', 'OEMC',
       'CITY COUNCIL', 'AVIATION', 'STREETS & SAN', 'FIRE',
       'FAMILY & SUPPORT', 'PUBLIC LIBRARY', 'TRANSPORTN',
       "MAYOR'S OFFICE", 'HEALTH', 'BUSINESS AFFAIRS', 'LAW', 'FINANCE',
       'CULTURAL AFFAIRS', 'COMMUNITY DEVELOPMENT', 'PROCUREMENT',
       'BUILDINGS', 'ANIMAL CONTRL', 'CITY CLERK', 'BOARD OF ELECTION',
       'DISABILITIES', 'HUMAN RESOURCES', 'DoIT', 'BUDGET & MGMT',
       'TREASURER', 'INSPECTOR GEN', 'HUMAN RELATIONS', 'COPA',
       'BOARD OF ETHICS', 'POLICE BOARD', 'ADMIN HEARNG',
       'LICENSE APPL COMM'], dtype=object)

In [64]:
departamentos[0]

13414

In [35]:
valores + departamentos

['POLICE',
 'GENERAL SERVICES',
 'WATER MGMNT',
 'OEMC',
 'CITY COUNCIL',
 'AVIATION',
 'STREETS & SAN',
 'FIRE',
 'FAMILY & SUPPORT',
 'PUBLIC LIBRARY',
 'TRANSPORTN',
 "MAYOR'S OFFICE",
 'HEALTH',
 'BUSINESS AFFAIRS',
 'LAW',
 'FINANCE',
 'CULTURAL AFFAIRS',
 'COMMUNITY DEVELOPMENT',
 'PROCUREMENT',
 'BUILDINGS',
 'ANIMAL CONTRL',
 'CITY CLERK',
 'BOARD OF ELECTION',
 'DISABILITIES',
 'HUMAN RESOURCES',
 'DoIT',
 'BUDGET & MGMT',
 'TREASURER',
 'INSPECTOR GEN',
 'HUMAN RELATIONS',
 'COPA',
 'BOARD OF ETHICS',
 'POLICE BOARD',
 'ADMIN HEARNG',
 'LICENSE APPL COMM',
 13414,
 4641,
 2198,
 2102,
 1879,
 1629,
 1140,
 1015,
 980,
 615,
 560,
 488,
 411,
 407,
 269,
 207,
 171,
 116,
 107,
 99,
 92,
 87,
 85,
 84,
 81,
 79,
 65,
 46,
 39,
 28,
 22,
 16,
 8,
 2,
 1]

In [34]:
salaries['Department'].value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

In [130]:
dic ={}
resultado = list(salaries.groupby('Department'))    # Agrupame por departamento y dime cuantos hay de cada departamento
for i in range (len(resultado)):
    dic[resultado[i][0]] = resultado[i][1]['Department'].count() # Aqui es indiferente poner la columna que sea ya que solo hace que contar el numero que hay por Departamento
dic


import operator
dic_ordenado = sorted(dic.items(), key=operator.itemgetter(1), reverse=True)
for department in enumerate(dic_ordenado):
    print(department[1][0], 'tiene', dic[department[1][0]], 'trabajadores')

POLICE tiene 13414 trabajadores
FIRE tiene 4641 trabajadores
STREETS & SAN tiene 2198 trabajadores
OEMC tiene 2102 trabajadores
WATER MGMNT tiene 1879 trabajadores
AVIATION tiene 1629 trabajadores
TRANSPORTN tiene 1140 trabajadores
PUBLIC LIBRARY tiene 1015 trabajadores
GENERAL SERVICES tiene 980 trabajadores
FAMILY & SUPPORT tiene 615 trabajadores
FINANCE tiene 560 trabajadores
HEALTH tiene 488 trabajadores
CITY COUNCIL tiene 411 trabajadores
LAW tiene 407 trabajadores
BUILDINGS tiene 269 trabajadores
COMMUNITY DEVELOPMENT tiene 207 trabajadores
BUSINESS AFFAIRS tiene 171 trabajadores
COPA tiene 116 trabajadores
BOARD OF ELECTION tiene 107 trabajadores
DoIT tiene 99 trabajadores
PROCUREMENT tiene 92 trabajadores
INSPECTOR GEN tiene 87 trabajadores
MAYOR'S OFFICE tiene 85 trabajadores
CITY CLERK tiene 84 trabajadores
ANIMAL CONTRL tiene 81 trabajadores
HUMAN RESOURCES tiene 79 trabajadores
CULTURAL AFFAIRS tiene 65 trabajadores
BUDGET & MGMT tiene 46 trabajadores
ADMIN HEARNG tiene 39 trabajadores
DISABILITIES tiene 28 trabajadores
TREASURER tiene 22 trabajadores
HUMAN RELATIONS tiene 16 trabajadores
BOARD OF ETHICS tiene 8 trabajadores
POLICE BOARD tiene 2 trabajadores
LICENSE APPL COMM tiene 1 trabajadores

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

ShapiroResult(statistic=nan, pvalue=1.0)

In [36]:
salaries.columns

Index(['Name', 'Job Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary', 'Hourly Rate'],
      dtype='object')

In [61]:
muestra =salaries['Hourly Rate'].dropna()

In [63]:
TEST = stats.ttest_1samp(muestra, 30)
TEST.pvalue

4.3230240486229894e-92

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [66]:
pochi = stats.ttest_1samp(departamentos[0],86000)
pochi

Ttest_1sampResult(statistic=nan, pvalue=nan)

In [171]:
muestra1 = salaries[salaries['Salary or Hourly']== 'Salary']
muestra2 = muestra1[salaries['Department'].str.contains('POLICE')]
muestron = muestra2.reset_index()

In [173]:
muestron

,index,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
3,11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
4,12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
...,...,...,...,...,...,...,...,...,...
13401,33177,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
13402,33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
13403,33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
13404,33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
13405,33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

In [174]:
muestron.describe()

              index  Typical Hours  Annual Salary  Hourly Rate
count  13406.000000            0.0   13406.000000          0.0
mean   16466.705356            NaN   86486.362226          NaN
std     9576.110468            NaN   18272.443068          NaN
min        0.000000            NaN   38376.000000          NaN
25%     8102.250000            NaN   84054.000000          NaN
50%    16553.500000            NaN   90024.000000          NaN
75%    24713.750000            NaN   94524.000000          NaN
max    33181.000000            NaN  260004.000000          NaN

In [176]:
mu = 86000 # media de la poblacion
mu_hat = 86486.362226    #media de la muestra
std =18272.443068 # desviacion estandar
n = 13406 # tamaño de nuestra muestra

t_test = (mu_hat - mu)/(std/np.sqrt(n))
t_test

3.081859443066299

In [201]:
p_value = 1-t(df=13405).cdf(t_test)
p_value > 0.05    # el p valor es menor del umbral por lo que rechazamos H0 y aceptamos H1 es decir los sueldos si que son mayores de 86k

False

Using the `crosstab` function, find the department that has the most hourly workers.

In [183]:
moremoney = pd.crosstab(salaries['Department'], salaries['Salary or Hourly'])
moremoney.sort_values('Hourly', ascending = True).tail(1)

Salary or Hourly  Hourly  Salary
Department
STREETS & SAN       1862     336

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [118]:
muestra3 = salaries.loc[salaries.Department == 'STREETS & SAN']['Hourly Rate'].dropna().tolist()
pagamas = stats.ttest_1samp(muestra3, 35)
pagamas.pvalue

3.3378530564707717e-21

In [121]:
pagamas.statistic # ni puta idea si esto esta bien

-9.567447887848152

In [191]:
moremoney3= salaries[salaries['Salary or Hourly']=='Hourly']
moremoney2 = moremoney3[moremoney3['Department'] == 'STREETS & SAN']
moremoney2.reset_index()

,index,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
1,21,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
2,24,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
3,36,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
4,39,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
...,...,...,...,...,...,...,...,...,...
1857,33106,"ZIZUMBO, JOSE N",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,36.13
1858,33107,"ZIZUMBO, LUIS",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
1859,33147,"ZUMMO, ROBERT J",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
1860,33149,"ZUNICH, JONATHAN G",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
1861,33156,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,22.12

In [193]:
moremoney2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1862 entries, 7 to 33156
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               1862 non-null   object
 1   Job Titles         1862 non-null   object
 2   Department         1862 non-null   object
 3   Full or Part-Time  1862 non-null   object
 4   Salary or Hourly   1862 non-null   object
 5   Typical Hours      1862 non-null   float64
 6   Annual Salary      0 non-null      float64
 7   Hourly Rate        1862 non-null   float64
dtypes: float64(3), object(5)
memory usage: 130.9+ KB

In [194]:
moremoney2.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    1862.000000            0.0  1862.000000
mean       37.137487            NaN    33.728378
std         8.777897            NaN     5.735242
min        10.000000            NaN    19.500000
25%        40.000000            NaN    35.600000
50%        40.000000            NaN    35.600000
75%        40.000000            NaN    36.210000
max        40.000000            NaN    53.100000

In [195]:
mu2 = 35
mu_hat2= 33.728378
std2 = 5.735242
n2 = 1862
t_test2 = (mu_hat2 - mu2)/(std2/np.sqrt(n2))
t_test2

-9.567448286050341

In [204]:
p_value2 =t(df=13405).cdf(t_test2)
p_value2 > 0.05  
print(f' p valor es {p_value2} y por tanto menor que 0,05,por tanto aceptamos H1, es decir los trabajadores tienen razon cobran menos de 35k')

 p valor es 6.422668660484905e-22 y por tanto menor que 0,05,por tanto aceptamos H1, es decir los trabajadores tienen razon cobran menos de 35k

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [151]:
muestra100 = salaries[(salaries['Salary or Hourly'] == 'Hourly')]['Hourly Rate']

ic = stats.t.interval(alpha =0.95,df = len(muestra100)-1,loc = muestra100.mean(), scale = stats.sem(muestra100))
ic

(32.52345834488425, 33.05365708767623)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [150]:
muestra1001 = salaries[(salaries['Salary or Hourly'] == 'Salary') & (salaries.Department == 'POLICE')]['Annual Salary']

ic1 = stats.t.interval(alpha =0.95,df = len(muestra1001)-1 ,loc = muestra1001.mean(), scale = stats.sem(muestra1001))
ic1

(86177.05631531784, 86795.77269094894)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [13]:
# Your code here: